
# ######################################################################## 
# Copyright (C) 2025 Altera Corporation.
# SPDX-License-Identifier: MIT
# ######################################################################## 
# -------------------------------------------------------------------------- #
set_time_format -unit ns -decimal_places 3

set qsfp_csr_clk soc_inst|iopll_0|iopll_csr_clk
set zl_clk l4_sp_clk_src

set_input_delay   -source_latency_included 1 -clock $qsfp_csr_clk  [get_ports qsfp_i2c_sda]
set_output_delay  -source_latency_included 1 -clock $qsfp_csr_clk [get_ports qsfp_i2c_scl]
set_output_delay  -source_latency_included 1 -clock $qsfp_csr_clk  [get_ports {qsfpa_modeseln[*]}]
set_output_delay  -source_latency_included 1 -clock $qsfp_csr_clk  [get_ports {qsfpa_lpmode[*]}]
set_output_delay  -source_latency_included 1 -clock $qsfp_csr_clk  [get_ports {qsfpa_resetn[*]}]
set_output_delay  -source_latency_included 1 -clock $qsfp_csr_clk [get_ports {o_ptp_pps}]
set_input_delay   -source_latency_included 1 -clock $zl_clk [get_ports zl_i2c_sda]
set_output_delay  -source_latency_included 1 -clock $zl_clk  [get_ports zl_i2c_scl]

set_false_path -from [get_ports {qsfp_i2c_scl}] -to *
set_false_path -from * -to [get_ports {qsfp_i2c_scl}]
set_false_path -from [get_ports {zl_i2c_scl}] -to *
set_false_path -from * -to [get_ports {zl_i2c_scl}]
set_false_path -from [get_ports {qsfp_i2c_sda}] -to *
set_false_path -from * -to [get_ports {qsfp_i2c_sda}]
set_false_path -from [get_ports {zl_i2c_sda}] -to *
set_false_path -from * -to [get_ports {zl_i2c_sda}]
set_false_path -from [get_ports {qsfpa_modprsln[*]}] -to *
set_false_path -from [get_ports {intn_qsfp}] -to *
set_false_path -from * -to [get_ports {qsfpa_modeseln[*]}]
set_false_path -from * -to [get_ports {qsfpa_lpmode[*]}]
set_false_path -from * -to [get_ports {qsfpa_resetn[*]}]
set_false_path -from * -to [get_ports {o_ptp_pps}]
set_false_path -from * -to [get_ports {o_clk_rec_div_66}]
set_false_path -from * -to [get_ports {o_clk_rec_div_66(n)}]

set_false_path -from [get_keepers -no_duplicates {soc_inst|iopll_0|iopll|tennm_ph2_iopll~pll_ctrl_reg}] -to [get_keepers -no_duplicates {sync_iopll_lock_161_*|dreg[*]}]
set_false_path -from [get_keepers -no_duplicates {gen_mulit_inst[*].hssi_ss_top|u0|intel_eth_gts_0|hip_inst|n_channel_superset_wrapper_inst|n_channel_superset|hal_top_wrapper_inst|hal_top_ip|one_lane_inst_0|one_lane_hal_top_p0|gen_non_usb_mode.pldif_hal_top_inst|pldif_hal_top|pldif_hal_coreip_inst|gen_sm_ch4_pldif_inst.sm_block.ch4_pldif_inst|x_std_sm_hssi_pld_chnl_dp_0~pldif_reset_reg}] -to [get_keepers -no_duplicates {sts_tx_pll_locked[*].tx_pll_locked|dreg[*]}]
set_false_path -from [get_keepers -no_duplicates {gen_mulit_inst[*].hssi_ss_top|u0|intel_eth_gts_0|sip_inst|o_rx_pcs_ready}] -to [get_keepers -no_duplicates {sts_rx_pcs_ready[*].rx_pcs_ready|dreg[*]}]
set_false_path -from [get_keepers -no_duplicates {gen_mulit_inst[*].hssi_ss_top|u0|intel_eth_gts_0|sip_inst|o_tx_lanes_stable}] -to [get_keepers -no_duplicates {sts_tx_lanes_stable[*].tx_lanes_stable|dreg[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|iopll_0|iopll|tennm_ph2_iopll~pll_ctrl_reg}] -to [get_keepers -no_duplicates {sync_iopll_lock_125M|dreg[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch1|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch1|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|read_valid}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch1|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch1|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|read_valid}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|reg_in[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|ts_fifo_rst}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|state.get_data}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|reg_in[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|toggled_signal}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|toggled_signal}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|inst_cdc_sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|reg_in[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|reg_in[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|to_cntr[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|*}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|toggled_signal}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|inst_cdc_sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|toggled_signal}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|reg_in[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|ts_fifo_rst}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|state.get_data}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|reg_in[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|toggled_signal}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|toggled_signal}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|inst_cdc_sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|reg_in[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|reg_in[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|to_cntr[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|*}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|toggled_signal}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|inst_cdc_sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|toggled_signal}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p0_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|read_enable_q1}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|read_pointer[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|out_data[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|reg_in[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|sync|q[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|fingerprint[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|in_valid}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|toggled_signal}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|sync_cnt[*]}]
set_false_path -from [get_keepers -no_duplicates {inst_srd_rst_ctrl|eth_reset_sync[*].eth_user_tx_rstn_sync_100M|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {sync_iopll_lock_100M|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|reg_in[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|state.wait_for_resp}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|reg_in[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {inst_srd_rst_ctrl|eth_reset_sync[*].eth_user_tx_rstn_sync_100M|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {sync_iopll_lock_100M|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|state.get_data}]
set_false_path -from [get_keepers -no_duplicates {sync_iopll_lock_100M|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {inst_srd_rst_ctrl|eth_reset_sync[*].eth_user_rx_rstn_sync_100M|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p1_eth_ch0|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|state.reset_valid}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|toggled_signal}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|inst_cdc_sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|toggled_signal*}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|inst_cdc_sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|toggled_signal*}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {inst_srd_rst_ctrl|eth_reset_sync[*].eth_user_rx_rstn_sync_100M|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|toggled_signal*}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|ms_tcam_regs_inst|mgmt_ctrl_reg.op_type[*]}] -to [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|sync1_mgmt_req_type[*]}]
set_false_path -from [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|entry_vld}] -to [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|sync_entry_vld}]
set_false_path -from [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|ms_tcam_regs_inst|mgmt_ctrl_reg.op_type[*]}] -to [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|sync1_mgmt_req_type[*]}]
set_false_path -from [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|ms_tcam_reset_manager_inst|ms_tcam_reset_sequencer_inst|int_warm_rst_n*}] -to [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|ms_tcam_reset_manager_inst|int_warm_rst_n_d1}]
set_false_path -from [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|ms_tcam_regs_inst|mgmt_ctrl_reg.op_type[*]*}] -to [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|sync1_mgmt_req_type[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|reg_in[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|toggled_signal}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|reg_in[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|read_valid}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|state.reset_valid}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|toggled_signal}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0_ch2|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|inst_cdc_sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|sync_cnt[*]}]
set_false_path -from [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|req_fifo_full_clk_extender|data_out}] -to [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|sync1_err_req_fifo_full}]
set_false_path -from [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|err_mgmt_req_valid}] -to [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|sync1_err_mgmt_req_valid}]
set_false_path -from [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|init_done}] -to [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|sync1_init_done}]
set_false_path -from [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|mgmt_resp_success}] -to [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|sync1_mgmt_resp_success}]
set_false_path -from [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|tg_sync_resp_valid|reg_in*}] -to [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|tg_sync_resp_valid|reg_out[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|ts_fifo_rst}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|state.get_data}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|read_enable*}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|read_pointer[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|to_cntr[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|state.wait_for_resp}]
set_false_path -from [get_keepers -no_duplicates {inst_srd_rst_ctrl|eth_reset_sync[*].eth_user_rx_rstn_sync_161M|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {inst_srd_rst_ctrl|eth_reset_sync[*].eth_user_tx_rstn_sync_161M|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|out_data[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|reg_in[*]}]
set_false_path -from [get_keepers -no_duplicates {sync_iopll_lock_161_1|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {inst_srd_rst_ctrl|eth_reset_sync[*].eth_user_rx_rstn_sync_161M|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|sync|q[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|sync|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|toggled_signal}]
set_false_path -from [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rst_controller|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|in_valid}]
set_false_path -from [get_keepers -no_duplicates {sync_iopll_lock_161_*|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {sync_iopll_lock_161_*|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0_ch2|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {sync_iopll_lock_161_*|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {sync_iopll_lock_161_*|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0|rx_dma_fifo_0|cdc_packet_fifo|translate_write_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {sync_iopll_lock_100M|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|ts_chs_compl_0|ts_chs_compl_0|ts_ch_resp[*].ts_fifo|dcfifo_component|auto_generated|*aclr*}]
set_false_path -from [get_keepers -no_duplicates {inst_srd_rst_ctrl|eth_reset_sync[*].eth_user_tx_rstn_sync_100M|dreg[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|ts_chs_compl_0|ts_chs_compl_0|ts_ch_resp[*].ts_fifo|dcfifo_component|auto_generated|wraclr*}]
set_false_path -from [get_keepers -no_duplicates {packet_switch_subsys|packet_switch_top|lite_rst_sync|syn_rst}] -to [get_keepers -no_duplicates {packet_switch_subsys|packet_switch_top|packet_switch_axi_lt_avmm_inst|gen_axi_lt_to_avmm[*].axi_lt_to_avmm_*|*_cdc_fifo|auto_generated|*aclr*}]
set_false_path -from [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|ms_tcam_reset_manager_inst|ms_tcam_reset_sequencer_inst|int_cold_rst_n}] -to [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|mgmt_req|dcfifo_component|auto_generated|*aclr*}]
set_false_path -from [get_keepers -no_duplicates {packet_switch_subsys|packet_switch_top|gen_rst_sync[*].*x_rst_sync|syn_rst}] -to [get_keepers -no_duplicates {packet_switch_subsys|packet_switch_top|packet_switch_axi_lt_avmm_inst|gen_axi_lt_to_avmm[*].axi_lt_to_avmm_*x|bresp_cdc_fifo|auto_generated|rdaclr*}]
set_false_path -from [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|ms_tcam_reset_manager_inst|int_warm_rst_n}] -to [get_keepers -no_duplicates {packet_switch_subsys|gen_tcam_inst[*].inst_tcam|mem_ss_cam_0|tcam_inst|mgmt_resp|dcfifo_component|auto_generated|rdaclr*}]
set_false_path -from [get_keepers -no_duplicates {master_tod_rst_sync|resync_chains[0].synchronizer_nocut|dreg_R}] -to [get_keepers -no_duplicates {master_tod|MTOD_GEN_PPS_ADV_MODE.master_tod|eth_1588_tod_0|genblk3.u_pulse_per_second_w|GTS_ADV_MODE_PPS.u_pulse_per_second_gts_adv|u_rst_sync_sampling_clk|nocut_sync[0].std_sync_no_cut|dreg[*]}]; 
set_false_path -from [get_keepers -no_duplicates {inst_srd_rst_ctrl|o_user_rx_rst_n_161_*d[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0*|rx_dma_fifo_0|cdc_packet_fifo|translate_*_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {inst_srd_rst_ctrl|o_user_rx_rst_n_100_*d[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|rx_dma_fifo_0*|rx_dma_fifo_0|cdc_packet_fifo|translate_*_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {inst_srd_rst_ctrl|o_user_tx_rst_n_161_*d[*]*}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0*|tx_dma_fifo_0|cdc_packet_fifo|translate_*_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {inst_srd_rst_ctrl|o_user_tx_rst_n_100_*d[*]*}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0*|tx_dma_fifo_0|cdc_packet_fifo|translate_*_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[*]}]
set_false_path -from [get_keepers -no_duplicates {inst_srd_rst_ctrl|o_user_tx_rst_n_100_*d[*]*}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|ts_chs_compl_0|ts_chs_compl_0|ts_ch_resp[*].ts_fifo|dcfifo_component|auto_generated|wraclr|*}]
set_false_path -from [get_keepers -no_duplicates {rd1|cntr[*]}] -to [get_keepers -no_duplicates {sync_ninit_done|*}]
set_false_path -from [get_keepers -no_duplicates {inst_srd_rst_ctrl|o_user_rx_rst_n_161_sig[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|*x_dma_fifo_0*|*x_dma_fifo_0|cdc_packet_fifo|translate_*_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[0]}]
set_false_path -from [get_keepers -no_duplicates {inst_srd_rst_ctrl|o_user_tx_rst_n_161_sig[*]}] -to [get_keepers -no_duplicates {soc_inst|subsys_msgdma_p*_eth_ch*|tx_dma_fifo_0|tx_dma_fifo_0|cdc_packet_fifo|translate_read_pointer|toggle_in|inst_cdc_sync_for_rst|in_data_meta[0]}]

